In [1]:
import numpy as np
import pandas as pd

In [2]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [3]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [4]:
obj['b']

1.0

In [5]:
obj[1]

1.0

In [6]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [7]:
obj[['a','b', 'c']]

a    0.0
b    1.0
c    2.0
dtype: float64

In [8]:
obj[[1,2]]

b    1.0
c    2.0
dtype: float64

In [10]:
obj[obj>=2]

c    2.0
d    3.0
dtype: float64

In [12]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [13]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [14]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [16]:
data[2:]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [18]:
data[['one', 'two']]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [19]:
data[data['two']>2]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [23]:
data[data<5] = 0

In [24]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

# Selection with loc and iloc

In [29]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [34]:
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [35]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [36]:
data.iloc[[1,2], [3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [37]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [39]:
data.iloc[:, :3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

# Indexing options with DataFrame

# df[val]

In [44]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [51]:
data['four']

Ohio         0
Colorado     7
Utah        11
New York    15
Name: four, dtype: int64

# df.loc[val]

In [56]:
data.loc['Colorado']

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [59]:
data.loc[['Colorado']]

          one  two  three  four
Colorado    0    5      6     7

In [58]:
data.loc[['Colorado', 'Ohio']]

          one  two  three  four
Colorado    0    5      6     7
Ohio        0    0      0     0

# df.loc[:, val]

In [61]:
data.loc[:, 'two']

Ohio         0
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [62]:
data.loc[:, ['two', 'three']]

          two  three
Ohio        0      0
Colorado    5      6
Utah        9     10
New York   13     14

In [64]:
data.loc["Colorado":, ['two', 'three']]

          two  three
Colorado    5      6
Utah        9     10
New York   13     14

# df.loc[val1, val2]

In [67]:
data.loc['Ohio', ['two']]

two      0
three    0
Name: Ohio, dtype: int64

In [68]:
data.loc['Ohio', ['two','three']]

two      0
three    0
Name: Ohio, dtype: int64

In [69]:
data.loc[['Ohio', 'Colorado'], ['two','three']]

          two  three
Ohio        0      0
Colorado    5      6

# df.iloc[where]

In [71]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [73]:
data.iloc[[2, 3]]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

# df.iloc[:, where]

In [76]:
data.iloc[:, 0]

Ohio         0
Colorado     0
Utah         8
New York    12
Name: one, dtype: int64

In [77]:
data.iloc[:, [0,1]]

          one  two
Ohio        0    0
Colorado    0    5
Utah        8    9
New York   12   13

# df.iloc[where_i, where_j]

In [79]:
data.iloc[2, 3]

11

# Integer Indexes

In [80]:
ser = pd.Series(np.arange(3.))

In [81]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [83]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [84]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [85]:
ser2[-1]

2.0

In [87]:
ser[:1]

0    0.0
dtype: float64

In [88]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [89]:
ser.iloc[:1]

0    0.0
dtype: float64